app/controllers/api/photos_controller.rb

INSERT INTO "photos" ("title", "img_url", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
    def create
        @photo = Photo.new(photo_params)

        if @photo.save

DELETE FROM "photos" WHERE "photos"."id" = $1  [["id", 1]]
---
    def destroy
        photo = current_user.photos.find_by(id: params[:id])
        if photo
            photo.destroy