app/models/user.rb

    def reset_session_token!
        self.update!(session_token: SecureRandom.urlsafe_base64(16))
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "SJdHwxOwRkvz3Dvvn6W8xA"], ["updated_at", "2019-11-14 22:48:41.297357"], ["id", 1]]